// 0. Js 引擎运行开始
var v = 'v';
var v2 = 'v2';

function Foo() {
    console.log('Foo v:' + v);
    console.log('Foo v2:' + v2);
    v = 'Foo';
    v2 = 'Foo';
}

function Bar(fn) {

    console.log(typeof Bar_fn);
    console.log(typeof Bar_fn2);

    var v = 'Bar';

    function Bar_fn() {
        console.log('Bar_fn v:' + v);
        v = 'Bar_fn';
    }
    var Bar_fn2;
    Bar_fn2 = function() {
        console.log('Bar_fn2 v2:' + v2);
        v2 = 'Bar_fn2';
    }

    fn(); // 2. 开始执行 fn()
    Bar_fn(); // 3. 开始执行 Bar_fn()
    Bar_fn2(); // 4. 开始执行 Bar_fn2()

    Bar_fn = 'string';

    console.log(typeof Bar_fn);
}

Bar(Foo, 'useless'); // 1. 开始执行Bar()
// 5. Bar()执行完...
console.log('v:' + v);
console.log('v2:' + v2);


/*
    0. Js 引擎运行开始,只有全局上下文
    ┌──────────────────────────────────────┐
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Global         │  │
    │  └────────────────────────────────┘  │
    └──────────────────────────────────────┘
    1. 开始执行 Bar(),ECStack.push(ExecuteContext Bar)
    ┌──────────────────────────────────────┐
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Bar            │  │
    │  └────────────────────────────────┘  │
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Global         │  │
    │  └────────────────────────────────┘  │
    └──────────────────────────────────────┘
    2. 开始执行 fn(),ECStack.push(ExecuteContext fn)
    ┌──────────────────────────────────────┐
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext fn             │  │
    │  └────────────────────────────────┘  │
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Bar            │  │
    │  └────────────────────────────────┘  │
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Global         │  │
    │  └────────────────────────────────┘  │
    └──────────────────────────────────────┘
    2. fn 返回,ESStac.pop();
    3. 开始执行 Bar_fn(),push Bar_fn 的ExecuteContext(fn已经退出,Bar并未返回)
    ┌──────────────────────────────────────┐
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Bar_fn         │  │
    │  └────────────────────────────────┘  │
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Bar            │  │
    │  └────────────────────────────────┘  │
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Global         │  │
    │  └────────────────────────────────┘  │
    └──────────────────────────────────────┘
    3. Bar_fn 返回,ESStac.pop();
    4. 开始执行 Bar_fn2(),push Bar_fn2 的ExecuteContext(fn,Bar_fn已经退出,Bar并未返回)
    ┌──────────────────────────────────────┐
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Bar_fn2        │  │
    │  └────────────────────────────────┘  │
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Bar            │  │
    │  └────────────────────────────────┘  │
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Global         │  │
    │  └────────────────────────────────┘  │
    └──────────────────────────────────────┘
    4. Bar_fn2 返回,ESStac.pop();
    5. Bar 返回,ESStac.pop();
    ┌──────────────────────────────────────┐
    │  ┌────────────────────────────────┐  │
    │  │  ExecuteContext Global         │  │
    │  └────────────────────────────────┘  │
    └──────────────────────────────────────┘
*/

/* Bar 的 Execute Context 结构类似下面
{
    VO: {
        arguments: {
            0: Foo,
            1: 'useless',
            length: 2
        },
        fn: Foo, // 参数
        v, // 声明的变量
        Bar_fn2, // 声明的变量(var可以变量提升) 但此时还未执行赋值语句
        Bar_fn: function() {...} //通过function创建的函数变量,与Bar_fn2有所不同,创建VO时候就声明并赋值了
    }
    this : {}, // this
    Scope : [] // 作用域链
}
*/